In [ ]:
import sqlite3 as s
import pandas as pd

In [ ]:
from google.colab import files
file = files.upload()

Saving database.sqlite to database.sqlite

KeyboardInterrupt: ignored

In [ ]:
conn = s.connect('database.sqlite')

In [ ]:
tables = pd.read_sql("""SELECT * 
                    FROM sqlite_master
                    WHERE type='table';""", conn)

In [ ]:
print(tables)

     type  ...                                                sql
0   table  ...  CREATE TABLE [Player] (\n\t[Player_Id]\tintege...
1   table  ...  CREATE TABLE [Extra_Runs] (\n\t[Match_Id]\tint...
2   table  ...  CREATE TABLE [Batsman_Scored] (\n\t[Match_Id]\...
3   table  ...  CREATE TABLE [Batting_Style] (\n\t[Batting_Id]...
4   table  ...  CREATE TABLE [Bowling_Style] (\n\t[Bowling_Id]...
5   table  ...  CREATE TABLE [Country] (\n\t[Country_Id]\tinte...
6   table  ...  CREATE TABLE [Season] (\n\t[Season_Id]\tintege...
7   table  ...  CREATE TABLE [City] (\n\t[City_Id]\tinteger NO...
8   table  ...  CREATE TABLE [Outcome] (\n\t[Outcome_Id]\tinte...
9   table  ...  CREATE TABLE [Win_By] (\n\t[Win_Id]\tinteger N...
10  table  ...  CREATE TABLE [Wicket_Taken] (\n\t[Match_Id]\ti...
11  table  ...  CREATE TABLE [Venue] (\n\t[Venue_Id]\tinteger ...
12  table  ...  CREATE TABLE [Extra_Type] (\n\t[Extra_Id]\tint...
13  table  ...  CREATE TABLE [Out_Type] (\n\t[Out_Id]\tinteger...
14  table  ...  CREATE TABLE [Toss_Decision] (\n\t[Toss_Id]\ti...
15  table  ...  CREATE TABLE [Umpire] (\n\t[Umpire_Id]\tintege...
16  table  ...  CREATE TABLE [Team] (\n\t[Team_Id]\tinteger NO...
17  table  ...  CREATE TABLE [Ball_by_Ball] (\n\t[Match_Id]\ti...
18  table  ...  CREATE TABLE [sysdiagrams] (\n\t[name]\tnvarch...
19  table  ...             CREATE TABLE sqlite_sequence(name,seq)
20  table  ...  CREATE TABLE [Match] (\n\t[Match_Id]\tinteger ...
21  table  ...  CREATE TABLE [Rolee] (\n\t[Role_Id]\tinteger N...
22  table  ...  CREATE TABLE [Player_Match] (\n\t[Match_Id]\ti...

[23 rows x 5 columns]

In [ ]:
b = pd.read_sql("""SELECT * from Country;""", conn)

In [ ]:
print(b)

    Country_Id  Country_Name
0            1         India
1            2  South Africa
2            3         U.A.E
3            4   New Zealand
4            5     Australia
5            6      Pakistan
6            7     Sri Lanka
7            8   West Indies
8            9     Zimbabwea
9           10       England
10          11    Bangladesh
11          12   Netherlands

In [ ]:
c = pd.read_sql("""SELECT * from Player;""", conn)

In [ ]:
print(c)

     Player_Id      Player_Name  ... Bowling_skill  Country_Name
0            1       SC Ganguly  ...           1.0             1
1            2      BB McCullum  ...           1.0             4
2            3       RT Ponting  ...           1.0             5
3            4        DJ Hussey  ...           2.0             5
4            5  Mohammad Hafeez  ...           2.0             6
..         ...              ...  ...           ...           ...
464        465        DL Chahar  ...           1.0             1
465        466       P Dharmani  ...           NaN             1
466        467         RV Pawar  ...           7.0             1
467        468       KH Devdhar  ...           NaN             1
468        469         T Mishra  ...           3.0             1

[469 rows x 6 columns]

In [ ]:
d=pd.read_sql("""SELECT * FROM Country INNER JOIN Player ON Country.Country_Id = Player.Country_Name;""", conn)

In [ ]:
print(d)

     Country_Id Country_Name  ...  Bowling_skill Country_Name
0             1        India  ...            1.0            1
1             4  New Zealand  ...            1.0            4
2             5    Australia  ...            1.0            5
3             5    Australia  ...            2.0            5
4             6     Pakistan  ...            2.0            6
..          ...          ...  ...            ...          ...
464           1        India  ...            1.0            1
465           1        India  ...            NaN            1
466           1        India  ...            7.0            1
467           1        India  ...            NaN            1
468           1        India  ...            3.0            1

[469 rows x 8 columns]

In [ ]:
conn.execute(""" CREATE TABLE IF NOT EXISTS CLA( RNO INT PRIMARY KEY NOT NULL, NAME TEXT NOT NULL, AGE INT DEFAULT(15), CONTACT INT NOT NULL);""")

In [ ]:
conn.execute(""" INSERT INTO CLA( RNO, NAME, AGE, CONTACT)\
                  VALUES
                  (001, "CHAITANYA", 14, 5129202568),
                  (002, "AARUSHI",15 , 908023184),
                  (003, "DEVAM", 16, 089237409),
                  (004, "ALLEN", 17, 982034792),
                  (005, "CALLIE", 14, 80237498)""");

In [ ]:
conn.execute(""" CREATE TABLE IF NOT EXISTS INF( RNO INT PRIMARY KEY NOT NULL, NAME TEXT NOT NULL, AGE INT DEFAULT(15), BLOOD_TYPE TEXT NOT NULL, ACCOUNT_NO INT NOT NULL);""")

In [ ]:
conn.execute(""" INSERT INTO INF( RNO, NAME, AGE, BLOOD_TYPE, ACCOUNT_NO)\
                  VALUES
                  (001, "CHAITANYA", 14, "O", 100),
                  (002, "AARUSHI",15 , "AB", 200),
                  (013, "DEVAM", 16, "A-", 300),
                  (014, "ALLEN", 17, "AB-", 400),
                  (015, "CALLIE", 14, "O", 500);""");

In [ ]:
b10 = pd.read_sql("""SELECT * from CLA;""", conn)
infirm = pd.read_sql("""SELECT * from INF;""", conn)

In [ ]:
print(b10)
print(infirm)

   RNO       NAME  AGE     CONTACT
0    1  CHAITANYA   14  5129202568
1    2    AARUSHI   15   908023184
2    3      DEVAM   16    89237409
3    4      ALLEN   17   982034792
4    5     CALLIE   14    80237498
   RNO       NAME  AGE BLOOD_TYPE  ACCOUNT_NO
0    1  CHAITANYA   14          O         100
1    2    AARUSHI   15         AB         200
2   13      DEVAM   16         A-         300
3   14      ALLEN   17        AB-         400
4   15     CALLIE   14          O         500

In [ ]:
print(pd.read_sql("""SELECT * from CLA as c where c.CONTACT==908023184;""", conn))

   RNO     NAME  AGE    CONTACT
0    2  AARUSHI   15  908023184

In [ ]:
pd.read_sql("""SELECT * FROM CLA as c INNER JOIN INF as i ON c.RNO > i.RNO ;""", conn)

   RNO     NAME  AGE    CONTACT  RNO       NAME  AGE BLOOD_TYPE  ACCOUNT_NO
0    2  AARUSHI   15  908023184    1  CHAITANYA   14          O         100
1    3    DEVAM   16   89237409    1  CHAITANYA   14          O         100
2    3    DEVAM   16   89237409    2    AARUSHI   15         AB         200
3    4    ALLEN   17  982034792    1  CHAITANYA   14          O         100
4    4    ALLEN   17  982034792    2    AARUSHI   15         AB         200
5    5   CALLIE   14   80237498    1  CHAITANYA   14          O         100
6    5   CALLIE   14   80237498    2    AARUSHI   15         AB         200

In [ ]:
pd.read_sql("""SELECT c.CONTACT FROM CLA as c INNER JOIN INF as i ON c.RNO = i.RNO ;""", conn)

      CONTACT
0  5129202568
1   908023184

In [ ]:
pd.read_sql("""SELECT * FROM CLA INNER JOIN INF ON CLA.RNO = INF.RNO WHERE CLA.RNO>2 ;""", conn)

Empty DataFrame
Columns: [RNO, NAME, AGE, CONTACT, RNO, NAME, AGE, BLOOD_TYPE, ACCOUNT_NO]
Index: []

In [ ]:
pd.read_sql("""SELECT * FROM CLA INNER JOIN INF ON CLA.RNO = INF.RNO WHERE CLA.RNO<2 ;""", conn)

   RNO       NAME  AGE     CONTACT  RNO       NAME  AGE BLOOD_TYPE  ACCOUNT_NO
0    1  CHAITANYA   14  5129202568    1  CHAITANYA   14          O         100